#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xCC (0x344 - 0x278)
// WidgetBlueprintGeneratedClass WBP_MainMenu_PalSkillInfo.WBP_MainMenu_PalSkillInfo_C
class UWBP_MainMenu_PalSkillInfo_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x278(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PalRichTextBlock_C*                BP_PalRichTextBlock_Info;                          // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalRichTextBlock_C*                BP_PalRichTextBlock_SubInfo;                       // 0x288(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                    BP_PalTextBlock_Name;                              // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          CanvasPanel_KeyGuide_ChangeWaza;                   // 0x298(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          CanvasPanel_KeyGuide_RemoveWaza;                   // 0x2A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        HorizontalBox_Status;                              // 0x2A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          SkillInfo;                                         // 0x2B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                    Text_CTNum;                                        // 0x2B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                    Text_PunishedLevel_Af;                             // 0x2C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                    Text_PunishedLevel_Pre;                            // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PalTextBlock_C*                    TextPowerNum;                                      // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_Pal_StatusElement_C*     WBP_MainMenu_Pal_StatusElement;                    // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                   PartnerMsgID;                                      // 0x2E0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   PassiveMsgID;                                      // 0x2F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   FoodMsgID;                                         // 0x300(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   HungerMsgID;                                       // 0x310(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   PalSkillMsgID;                                     // 0x320(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                   EquipMsgID;                                        // 0x330(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                        EquipValue;                                        // 0x340(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWBP_MainMenu_PalSkillInfo_C* GetDefaultObj();

	void PlayerEquipInfoFormat(enum class E_PalUIStatusDIsplayParameter Status, bool IsPlayer, class FText* FormatText, bool CallFunc_Greater_IntInt_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, bool K2Node_SwitchEnum_CmpSuccess, class APalPlayerCharacter* CallFunc_GetPalmi_ReturnValue, const struct FGuid& CallFunc_GetPlayerUIDByActor_ReturnValue, class FText CallFunc_GetLocalizedTextFromHandle_Text, int32 CallFunc_GetPlayerEquipmentDefense_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, int32 CallFunc_GetPlayerEquipmentHP_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue_1, class FText CallFunc_MakeLiteralText_ReturnValue_2, class FText CallFunc_SelectText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, class FText CallFunc_SelectText_ReturnValue_1);
	void ConvertToFoodRate(enum class EPalPassiveSkillEffectType PassiveEffect, enum class EPalFoodStatusEffectType* FoodEffect, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2);
	void WeightInfoFormat(class FText* FormatText, class UPalPlayerInventoryData* CallFunc_GetLocalInventoryData_ReturnValue, class FText CallFunc_GetLocalizedTextFromHandle_Text, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, bool CallFunc_Greater_DoubleDouble_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, bool CallFunc_NotEqual_DoubleDouble_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue_1, class FText CallFunc_MakeLiteralText_ReturnValue_2, class FText CallFunc_SelectText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, class FText CallFunc_SelectText_ReturnValue_1, double CallFunc_NotEqual_DoubleDouble_A_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast);
	void SetSkillInfo(bool ShowChangeWazaKeyGuide, bool ShowRemoveWazaKeyGuide, enum class EPalWazaID WazaID, bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, enum class ESlateVisibility Temp_byte_Variable_2, enum class ESlateVisibility Temp_byte_Variable_3, enum class ESlateVisibility K2Node_Select_Default, class FText CallFunc_GetWazaDesc_outDesc, class FText CallFunc_GetWazaName_outName, class UPalWazaDatabase* CallFunc_GetWazaDatabase_ReturnValue, enum class ESlateVisibility K2Node_Select_Default_1, const struct FPalWazaDatabaseRaw& CallFunc_FindWazaForBP_OutData, bool CallFunc_FindWazaForBP_ReturnValue, class FText CallFunc_Conv_DoubleToText_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, double CallFunc_Conv_DoubleToText_Value_ImplicitCast);
	void SubInfoFormat(class FText Name, double Value, class FText* FormatText, class FText CallFunc_MakeLiteralText_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, bool CallFunc_NotEqual_DoubleDouble_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, int32 CallFunc_Round_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue_1, int64 CallFunc_Conv_IntToInt64_ReturnValue, class FText CallFunc_SelectText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, class FText CallFunc_MakeLiteralText_ReturnValue_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, class FText CallFunc_SelectText_ReturnValue_1);
	void SetCommonInfo(class FText Title, class FText Info, class FText SubInfo);
	void SetStatusInfo(class FText Title, class FText Desc, class UPalIndividualCharacterParameter* IndividualParam, enum class E_PalUIStatusDIsplayParameter StatusType, bool IsPlayer);
	void ExecuteUbergraph_WBP_MainMenu_PalSkillInfo(int32 EntryPoint, enum class E_PalUIStatusDIsplayParameter Temp_byte_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 Temp_int_Variable_2, enum class E_PalUIStatusDIsplayParameter Temp_byte_Variable_1, int32 Temp_int_Variable_3, int32 Temp_int_Variable_4, int32 Temp_int_Variable_5, enum class E_PalUIStatusDIsplayParameter Temp_byte_Variable_2, enum class EPalPassiveSkillEffectType Temp_byte_Variable_3, enum class EPalPassiveSkillEffectType Temp_byte_Variable_4, enum class EPalPassiveSkillEffectType Temp_byte_Variable_5, enum class EPalPassiveSkillEffectType Temp_byte_Variable_6, enum class EPalPassiveSkillEffectType Temp_byte_Variable_7, enum class EPalPassiveSkillEffectType Temp_byte_Variable_8, enum class EPalPassiveSkillEffectType Temp_byte_Variable_9, enum class EPalPassiveSkillEffectType Temp_byte_Variable_10, bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable_11, enum class ESlateVisibility Temp_byte_Variable_12, class FText K2Node_CustomEvent_Title_1, class FText K2Node_CustomEvent_Info, class FText K2Node_CustomEvent_SubInfo, class FText K2Node_CustomEvent_Title, class FText K2Node_CustomEvent_Desc, class UPalIndividualCharacterParameter* K2Node_CustomEvent_IndividualParam, enum class E_PalUIStatusDIsplayParameter K2Node_CustomEvent_StatusType, bool K2Node_CustomEvent_IsPlayer, bool CallFunc_TextIsEmpty_ReturnValue, class FText CallFunc_PlayerEquipInfoFormat_FormatText, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, enum class ESlateVisibility K2Node_Select_Default, enum class EPalBaseCampWorkerSickType CallFunc_GetWorkerSick_ReturnValue, enum class EPalPassiveSkillEffectType K2Node_Select_Default_1, class FText CallFunc_GetWorkSickName_outName, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, enum class EPalFoodStatusEffectType CallFunc_ConvertToFoodRate_FoodEffect, float CallFunc_GetRatePartnerSkill_ReturnValue, float CallFunc_GetFoodStatusRate_ReturnValue, float CallFunc_GetRatePassiveSkill_ReturnValue, float CallFunc_GetCraftSpeedSickRate_ReturnValue, float CallFunc_HungerParameterRate_ReturnValue, double CallFunc_SelectFloat_ReturnValue, const struct FFixedPoint64& CallFunc_GetMaxHP_withBuff_ReturnValue, class FText CallFunc_SubInfoFormat_FormatText, int32 CallFunc_Convert_FixedPoint64ToInt_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, int32 CallFunc_GetMaxHP_ReturnValue, int32 CallFunc_GetCraftSpeed_withBuff_ReturnValue, int32 CallFunc_GetCraftSpeed_ReturnValue, int32 CallFunc_GetDefense_ReturnValue, int32 CallFunc_GetShotAttack_ReturnValue, int32 CallFunc_GetDefense_withBuff_ReturnValue, int32 CallFunc_GetShotAttack_withBuff_ReturnValue, class FText CallFunc_GetLocalizedTextFromHandle_Text, class FText CallFunc_GetLocalizedTextFromHandle_Text_1, class FText CallFunc_SubInfoFormat_FormatText_1, class FText CallFunc_SubInfoFormat_FormatText_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, class FText CallFunc_GetLocalizedTextFromHandle_Text_2, class FText CallFunc_GetLocalizedTextFromHandle_Text_3, class FText CallFunc_SubInfoFormat_FormatText_3, class FText CallFunc_SubInfoFormat_FormatText_4, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_4, enum class ESlateVisibility Temp_byte_Variable_13, enum class ESlateVisibility Temp_byte_Variable_14, bool Temp_bool_Variable_1, class FText CallFunc_WeightInfoFormat_FormatText, class UPalPlayerInventoryData* CallFunc_GetLocalInventoryData_ReturnValue, class FText CallFunc_SelectText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_5, int32 CallFunc_FTrunc_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, int32 K2Node_Select_Default_2, class FText CallFunc_Format_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, const class FString& CallFunc_Split_LeftS, const class FString& CallFunc_Split_RightS, bool CallFunc_Split_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, int32 CallFunc_FTrunc_ReturnValue_1, int32 K2Node_Select_Default_3, int32 CallFunc_Subtract_IntInt_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, enum class ESlateVisibility K2Node_Select_Default_4, double CallFunc_SubInfoFormat_Value_ImplicitCast, double CallFunc_SubInfoFormat_Value_ImplicitCast_1, double CallFunc_SubInfoFormat_Value_ImplicitCast_2, double CallFunc_SelectFloat_A_ImplicitCast, double CallFunc_SubInfoFormat_Value_ImplicitCast_3, double CallFunc_FTrunc_A_ImplicitCast, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, double CallFunc_Subtract_DoubleDouble_B_ImplicitCast);
};

}


